Repository: KDE/kcachegrind
Catalog: po/*/kcachegrind.po
Languages: eo

# NAME OF TRANSLATORS
source: Your names
eo: Axel Rousseau,Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
eo: axel@esperanto-jeunes.org,okellogg@users.sourceforge.net

source: (always)
eo: (ĉiam)

source: Choose Source Folder
eo: Elektu Fontan Dosierujo

source: Configuration
eo: Agordo

source: General
eo: Ĝeneralo

source: Maximum number of items in lists:
eo: Maksimuma nombro da eroj en listoj:

source: Truncate symbols in tooltips and context menus
eo: Detranĉu simbolojn en konsiletoj kaj kuntekstaj menuoj

source: when more than:
eo: kiam pli ol:

source: when longer than:
eo: kiam pli longa ol:

source: Precision of percentage values:
eo: Precizeco de procentaj valoroj:

source: The Maximum Number of List Items should be below 500.
eo: La Maksimuma Nombro de Listo-Eroj devus esti sub 500.

source: Cost Item Colors
eo: Kostelementaj Koloroj

source: Automatic
eo: Aŭtomata

source: Object:
eo: Objekto:

source: Class:
eo: Klaso:

source: File:
eo: Dosiero:

source: Annotations
eo: Komentarioj

source: Context lines in annotations:
eo: Kuntekstlinioj en komentarioj:

source: Source Folders
eo: Fontaj Dosierujoj

source: Add
eo: Aldoni

source: Delete
eo: Forigi

source: Object / Related Source Base
eo: Objekto / Rilata Fonto Bazo

source: Profile Dumps
eo: Profildepono

source: Target
eo: Celo

source: Time
eo: Tempo

source: Path
eo: Vojo

source: Options
eo: Opcioj

source: Target command:
eo: Cela komando:

source: Profiler options:
eo: Opcioj de Profililo:

source: Option
eo: Opcio

source: Value
eo: Valoro

source: Trace
eo: Spuro

source: Jumps
eo: Saltoj

source: Instructions
eo: Instrukcioj

source: Events
eo: Eventoj

source: Full Cache
eo: Plena Kaŝmemoro

source: Custom
eo: Propra

source: Collect
eo: Kolekti

source: At Startup
eo: Ĉe Ekfunkciigo

source: While In
eo: Dum En

source: Skip
eo: Preterlasi

source: Function
eo: Funkcio

source: Dump Profile
eo: Deponi Profilon

source: Every BBs
eo: Ĉiu BB-oj

source: On Entering
eo: Je Eniro

source: On Leaving
eo: Je Forlaso

source: Zero Events
eo: Nul Eventoj

source: Separate
eo: Aparta

source: Threads
eo: Fadenoj

source: Recursions
eo: Rikuroj

source: Call Chain
eo: Voka Ĉeno

source: Custom profiler options:
eo: Propraj profilaj opcioj:

source: Run New Profile
eo: Ruli Novan Profilon

source: Info
eo: Informo

source: Dump reason:
eo: Deponkialo:

source: Event summary:
eo: Resumo de evento:

source: Name
eo: Nomo

source: Sum
eo: Sumo

source: Miscellaneous:
eo: Diversaĵoj:

source: Show
eo: Montri

source: Compare
eo: Kompari

source: State
eo: Stato

source: Update
eo: Ĝisdatigi

source: Every [s]:
eo: Ĉiu [s]:

source: Counter
eo: Nombrilo

source: Dumps Done
eo: Deponoj Faritaj

source: Is Collecting
eo: Estas Kolektanta

source: Executed
eo: Plenumita

source: Basic Blocks
eo: Bazaj Blokoj

source: Calls
eo: Vokoj

source: Distinct
eo: Unika

source: ELF Objects
eo: ELF-Objektoj

source: Functions
eo: Funkcioj

source: Contexts
eo: Kuntekstoj

source: Stack trace:
eo: Stakspuro:

source: Sync.
eo: Sinkronig.

source: Incl.
eo: Inkl.

source: Called
eo: Vokita

source: Location
eo: Loko

source: Start
eo: Lanĉi

source: Zero
eo: Nulo

source: Messages
eo: Mesaĝoj

source: Kill Run
eo: Ĉesigi Rulon

source: Clear
eo: Forviŝi

source: &File
eo: &Dosiero

source: &View
eo: &Rigardi

source: &Layout
eo: &Aranĝo

source: Sidebars
eo: Flankbretoj

source: Main Toolbar
eo: Ĉefa ilobreto

source: State Toolbar
eo: Stata Ilobreto

source: KDE Frontend for Callgrind/Cachegrind
eo: KDE Frontend por Callgrind/Cachegrind

source: Author/Maintainer
eo: Aŭtoro/Prizorganto

source: Show information of this trace
eo: Montri informojn pri ĉi tiu spuro

source: [trace...]
eo: [spuro...]

source: Parts Overview
eo: Partoj Superrigardo

source: Top Cost Call Stack
eo: Plej Kosta Vokostako

source: <b>The Top Cost Call Stack</b><p>This is a purely fictional 'most probable' call stack. It is built up by starting with the current selected function and adds the callers/callees with highest cost at the top and to bottom.</p><p>The <b>Cost</b> and <b>Calls</b> columns show the cost used for all calls from the function in the line above.</p>
eo: <b>La Plej Kosta Vokstako</b><p>Ĉi tio estas pure fikcia "plej verŝajna" voka stako. Ĝi estas konstruita komencante per la nuna elektita funkcio kaj aldonas la alvokantojn/vokojn kun plej alta kosto supre kaj malsupre.</p><p>La <b>Kosto</b> kaj <b>Vokoj</b> kolumnoj montras la koston uzatan por ĉiuj vokoj de la funkcio en la supra linio.</p>

source: Flat Profile
eo: Plata Profilo

source: <b>Profile Dumps</b><p>This dockable shows in the top part the list of loadable profile dumps in all subdirectories of: <ul><li>current working directory of KCachegrind, i.e. where it was started from, and </li><li>the default profile dump directory given in the configuration.</li></ul> The list is sorted according to the target command profiled in the corresponding dump.</p><p>On selecting a profile dump, information for it is shown in the bottom area of the dockable: <ul><li><b>Options</b> allows you to view the profiled command and profile options of this dump. By changing any item, a new (yet unexisting) profile template is created. Press <b>Run Profile</b> to start a profile run with these options in the background. </li><li><b>Info</b> gives detailed info on the selected dump like event cost summary and properties of the simulated cache. </li><li><b>State</b> is only available for current happening profiles runs. Press <b>Update</b> to see different counters of the run, and a stack trace of the current position in the program profiled. Check the <b>Every</b> option to let KCachegrind regularly poll these data. Check the <b>Sync</b> option to let the dockable activate the top function in the current loaded dump.</li></ul></p>
eo: <b>Profilo-deŝargiloj</b><p>Ĉi tiu aldokebla montras en la supra parto la liston de ŝarĝeblaj profil-dupoj en ĉiuj subdosierujoj de: <ul><li>nuna labordosierujo de KCachegrind, t.e. de kie ĝi estis komencita, kaj </li><li>la defaŭlta profila rubujo dosierujo donita en la agordo.</li></ul> La listo estas ordigita laŭ la cela komando profilita en la responda rubujo.</p><p>Ĉe elektante profildump, informoj pri ĝi estas montrata en la malsupra areo de la aldokebla: <ul><li><b>Opcioj</b> permesas vidi la profilitajn komandon kaj profilopciojn de ĉi tiu rubejo. Ŝanĝante iun eron, nova (tamen neekzistanta) profilŝablono estas kreita. Premu <b>Run Profile</b> por komenci profilfunkciadon kun ĉi tiuj opcioj en la fono. </li><li><b>Informoj</b> donas detalajn informojn pri la elektita rubejo kiel eventokostoresumo kaj ecoj de la ŝajniga kaŝmemoro. </li><li><b>Ŝtato</b> disponeblas nur por aktualaj profilaj kuroj. Premu <b>Ĝisdatigi</b> por vidi malsamajn nombrilojn de la kuro, kaj stakspuron de la nuna pozicio en la programo profilita. Kontrolu la opcion <b>Ĉiu</b> por lasi KCachegrind regule baloti tiujn datumojn. Kontrolu la opcion <b>Sinkronigi</b> por lasi la aldokeblan aktivigi la supran funkcion en la nuna ŝarĝita rubejo.</li></ul></p>

source: &Duplicate
eo: &Duobligi

source: <b>Duplicate Current Layout</b><p>Make a copy of the current layout.</p>
eo: <b>Dobligi la nunan aranĝon</b><p>Faru kopion de la nuna aranĝo.</p>

source: &Remove
eo: Fo&rigi

source: <b>Remove Current Layout</b><p>Delete current layout and make the previous active.</p>
eo: <b>Forigi Nunan Aranĝon</b><p>Forigi nunan aranĝon kaj aktivigi la antaŭan.</p>

source: &Go to Next
eo: &Iri al Sekva

source: Go to Next Layout
eo: Iri al Sekva Aranĝo

source: &Go to Previous
eo: &Iri al Antaŭa

source: Go to Previous Layout
eo: Iri al Antaŭa Aranĝo

source: &Restore to Default
eo: &Restarigi al defaŭlto

source: Restore Layouts to Default
eo: Restarigi Aranĝojn al Defaŭlta

source: &Save as Default
eo: &Konservi kiel defaŭlta

source: Save Layouts as Default
eo: Konservi Aranĝojn kiel Defaŭlton

source: <b>New</b><p>Open new empty KCachegrind window.</p>
eo: <b>Nova</b><p>Malfermu novan malplenan fenestron de KCachegrind.</p>

source: &Add...
eo: &Aldoni...

source: <b>Add Profile Data</b><p>This opens an additional profile data file in the current window.</p>
eo: <b>Aldoni Profilajn Datumojn</b><p>Ĉi tio malfermas plian profilan datumdosieron en la nuna fenestro.</p>

# Reload a document
source: &Reload
eo: &Reŝargi

source: <b>Reload Profile Data</b><p>This loads any new created parts, too.</p>
eo: <b>Reŝargi Profilajn Datumojn</b><p>Ĉi tio ŝargas ankaŭ novajn kreitajn partojn.</p>

source: &Export Graph
eo: &Eksporti Grafeon

source: <b>Export Call Graph</b><p>Generates a file with extension .dot for the tools of the GraphViz package.</p>
eo: <b>Eksporti Call Graph</b><p>Generas dosieron kun etendo .dot por la iloj de la pakaĵo GraphViz.</p>

source: &Force Dump
eo: &Devigi Deponon

source: <b>Force Dump</b><p>This forces a dump for a Callgrind profile run in the current directory. This action is checked while KCachegrind looks for the dump. If the dump is finished, it automatically reloads the current trace. If this is the one from the running Callgrind, the new created trace part will be loaded, too.</p><p>Force dump creates a file 'callgrind.cmd', and checks every second for its existence. A running Callgrind will detect this file, dump a trace part, and delete 'callgrind.cmd'. The deletion is detected by KCachegrind, and it does a Reload. If there is <em>no</em> Callgrind running, press 'Force Dump' again to cancel the dump request. This deletes 'callgrind.cmd' itself and stops polling for a new dump.</p><p>Note: A Callgrind run <em>only</em> detects existence of 'callgrind.cmd' when actively running a few milliseconds, i.e. <em>not</em> sleeping. Tip: For a profiled GUI program, you can awake Callgrind e.g. by resizing a window of the program.</p>
eo: <b>Devigi Deponon</b><p>Ĉi tio devigas dump-on por Callgrind-profilo rulita en la nuna dosierujo. Ĉi tiu ago estas kontrolita dum KCachegrind serĉas la rubejon. Se la rubejo estas finita, ĝi aŭtomate reŝargas la nunan spuron. Se ĉi tiu estas tiu de la ruliĝanta Callgrind, ankaŭ la nova kreita spurparto estos ŝargita.</p><p>Forcidump kreas dosieron 'callgrind.cmd', kaj kontrolas ĉiun sekundon por ĝia ekzisto. Kuranta Callgrind detektos ĉi tiun dosieron, forĵetos spurparton kaj forigos 'callgrind.cmd'. La forigo estas detektita de KCachegrind, kaj ĝi faras Reŝargi. Se <em>ne</em> Callgrind funkcias, premu 'Devigi Deponon' denove por nuligi la elĵetaĵon. Ĉi tio forigas 'callgrind.cmd' mem kaj ĉesas voĉdoni por nova depono.</p><p>Noto: Callgrind-kuro <em>nur</em> detektas ekziston de 'callgrind.cmd' kiam aktive funkcias kelkajn milisekundojn. , t.e. <em>ne</em> dormante. Konsilo: Por profilita GUI-programo, vi povas veki Callgrind ekz. per regrandigo de fenestro de la programo.</p>

source: <b>Open Profile Data</b><p>This opens a profile data file, with possible multiple parts</p>
eo: <b>Malfermi Profilajn Datumojn</b><p>Ĉi tio malfermas profilan datuman dosieron, kun eblaj pluraj partoj</p>

source: Show/Hide the Parts Overview Dockable
eo: Montri/Kaŝi la Partojn Superrigardon Dockable

source: Call Stack
eo: Vokstako

source: Show/Hide the Call Stack Dockable
eo: Montri/Kaŝi la Vokan Stakon Dockable

source: Function Profile
eo: Funkcia Profilo

source: Show/Hide the Function Profile Dockable
eo: Montri/Kaŝi la Funkcian Profilon Dockable

source: Show/Hide the Profile Dumps Dockable
eo: Montri/Kaŝi la Dockable de Profildeponoj

source: Relative
eo: Parenco

source: Show relative instead of absolute costs
eo: Montri relativajn anstataŭ absolutajn kostojn

source: Relative to Parent
eo: Rilate al Gepatro

source: Show percentage costs relative to parent
eo: Montri procentajn kostojn rilate al gepatro

source: <b>Show percentage costs relative to parent</b><p>If this is switched off, percentage costs are always shown relative to the total cost of the profile part(s) that are currently browsed. By turning on this option, percentage cost of shown cost items will be relative to the parent cost item.</p><ul><table><tr><td><b>Cost Type</b></td><td><b>Parent Cost</b></td></tr><tr><td>Function Cumulative</td><td>Total</td></tr><tr><td>Function Self</td><td>Function Group (*) / Total</td></tr><tr><td>Call</td><td>Function Inclusive</td></tr><tr><td>Source Line</td><td>Function Inclusive</td></tr></table></ul><p>(*) Only if function grouping is switched on (e.g. ELF object grouping).</p>
eo: <b>Montri procentajn kostojn rilate al gepatro</b><p>Se ĉi tio estas malŝaltita, procentaj kostoj ĉiam montriĝas rilate al la totalkosto de la profilparto(j) kiuj estas nuntempe foliumitaj. Enŝaltante ĉi tiun opcion, procentkosto de montrataj kostaĵoj estos relativa al la gepatra kosto.</p><ul><table><tr><td><b>Kostotipo</b></td><td><b>Gepatra Kosto</b></td></tr><tr><td>Funkcio Akumula</td><td>Sumo</td></tr><tr><td>Funkcio Mem</td><td>Funkcia Grupo (*) / Totala</td></tr><tr><td>Voko</td><td>Funkcio Inkluziva</td></tr><tr><td>Fontolinio</td><td>Funkcio Inkluziva</td></tr></table></ul><p>(*) Nur se funkciogrupo estas ŝaltita (ekz. ELF-objektogrupigo).</p>

source: Cycle Detection
eo: Cikla Detekto

source: <b>Detect recursive cycles</b><p>If this is switched off, the treemap drawing will show black areas when a recursive call is made instead of drawing the recursion ad infinitum. Note that the size of black areas often will be wrong, as inside recursive cycles the cost of calls cannot be determined; the error is small, however, for false cycles (see documentation).</p><p>The correct handling for cycles is to detect them and collapse all functions of a cycle into an artificial function, which is done when this option is selected. Unfortunately, with GUI applications, this often will lead to huge false cycles, making the analysis impossible; therefore, there is the option to switch this off.</p>
eo: <b>Detekti rekursivajn ciklojn</b><p>Se ĉi tio estas malŝaltita, la arbomapo-desegnaĵo montros nigrajn areojn kiam rekursiva voko estas farita anstataŭ desegni la rekursion ad infinitum. Notu ke la grandeco de nigraj areoj ofte estos malĝusta, ĉar ene de rekursiemaj cikloj la kosto de vokoj ne povas esti determinita; la eraro estas malgranda, tamen, por falsaj cikloj (vidu dokumentadon).</p><p>La ĝusta uzado por cikloj estas detekti ilin kaj kolapsigi ĉiujn funkciojn de ciklo en artefaritan funkcion, kio estas farita kiam ĉi tiu opcio estas; elektita. Bedaŭrinde, kun GUI-aplikoj, tio ofte kondukos al grandegaj falsaj cikloj, farante la analizon malebla; tial, ekzistas la eblo por malŝalti ĉi tion.</p>

source: Shorten Templates
eo: Mallongigi Ŝablonojn

source: Hide Template Parameters in C++ Symbols
eo: Kaŝi Ŝablonajn Parametrojn en C++-Simboloj

source: <b>Hide Template Parameters in C++ Symbols</b><p>If this is switched on, every symbol displayed will have any C++ template parameters hidden, just showing &lt;&gt; instead of a potentially nested template parameter.</p><p>In this mode, you can hover the mouse pointer over the activated symbol label to show a tooltip with the unabbreviated symbol.</p>
eo: <b>Kaŝi Ŝablonajn parametrojn en C++-Simboloj</b><p>Se ĉi tio estas ŝaltita, ĉiu simbolo montrita havos ajnajn C++-ŝablonajn parametrojn kaŝitajn, nur montrante &lt;&gt; anstataŭ eble nestigita ŝablona parametro.</p><p>En ĉi tiu reĝimo, vi povas ŝvebi la musmontrilon super la aktivigita simboletikedo por montri konsileton kun la nemallongigita simbolo.</p>

source: &Up
eo: &Supren

source: <b>Go Up</b><p>Go to last selected caller of current function. If no caller was visited, use that with highest cost.</p>
eo: <b>Iri Supren</b><p>Iru al la lasta elektita alvokanto de aktuala funkcio. Se neniu alvokanto estis vizitita, uzu tion kun plej alta kosto.</p>

source: Go back in function selection history
eo: Reiri al la historio de elekto de funkcioj

source: Go forward in function selection history
eo: Antaŭeniri en la historio de elekto de funkcioj

source: Primary Event Type
eo: Ĉefa Eventtipo

source: Select primary event type of costs
eo: Elekti ĉefan eventotipon de kostoj

source: Secondary Event Type
eo: Malĉefa Eventa Tipo

source: Select secondary event type for cost e.g. shown in annotations
eo: Elektu duarangan eventotipon por kosto ekz. montrata en komentarioj

source: Grouping
eo: Grupado

source: Select how functions are grouped into higher level cost items
eo: Elekti kiel funkcioj estas grupigitaj en pli altnivelajn kostobjektojn

source: (No Grouping)
eo: (Neniu grupigo)

source: Show two information panels
eo: Montri du informpanelojn

source: Split Horizontal
eo: Partigi Horizontale

source: Change Split Orientation when main window is split.
eo: Ŝanĝi Dividan Orientiĝon kiam ĉefa fenestro estas disigita.

source: Select Callgrind Profile Data
eo: Elekti Profilajn Datumojn de Callgrind

source: Callgrind Profile Data (cachegrind.out* callgrind.out*);;All Files (*)
eo: Callgrind Profildatumoj (cachegrind.out* callgrind.out*);;Ĉiuj Dosieroj (*)

source: Could not open the file "%1". Check it exists and you have enough permissions to read it.
eo: Ne eblis malfermi la dosieron "%1". Kontrolu ke ĝi ekzistas kaj vi havas sufiĉajn permesojn por legi ĝin.

source: Add Callgrind Profile Data
eo: Aldoni Profilajn Datumojn de Callgrind

source: (Hidden)
eo: (Kaŝita)

source: Hide
eo: Kaŝi

source: Show Absolute Cost
eo: Montri Absolutan Koston

source: Show Relative Cost
eo: Montri Relativan Koston

source: Go Back
eo: Malantaŭen

source: Go Forward
eo: Antaŭen

source: Go Up
eo: Iri supren

source: Layout Count: %1
eo: Nombro de Aranĝo: %1

source: No profile data file loaded.
eo: Neniu profila datumdosiero ŝargita.

source: Total %1 Cost: %2
eo: Totala %1 Kosto: %2

source: No event type selected
eo: Neniu eventospeco elektita

source: Cannot determine receiver PID for dump request
eo: Ne povas determini ricevilan PID por forĵetpeto

source: Error running callgrind_control
eo: Eraro dum rulado de callgrind_control

source: (No Stack)
eo: (Neniu stako)

source: (No next function)
eo: (Neniu sekva funkcio)

source: (No previous function)
eo: (Neniu antaŭa funkcio)

source: (No Function Up)
eo: (Neniu Funkcio Supre)

source: Loading %1
eo: Ŝargante %1

source: Error loading %1: %2
eo: Eraro dum la ŝargo de %1: %2
